Revit 2027 API
MEPSystem.GetPhysicalNetworksNumber Method
 Get the physical networks number in the system.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int GetPhysicalNetworksNumber()
Public Function GetPhysicalNetworksNumber As Integer
public:
int GetPhysicalNetworksNumber()
member GetPhysicalNetworksNumber : unit -> int
Return Value
Int32
 The number of physical networks.
See Also
Reference
MEPSystem Class
Autodesk.Revit.DB Namespace